<a href="https://colab.research.google.com/github/plaban1981/INEURON/blob/master/Pandas_data_manipulation_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [0]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
151          152         1       1  ...  66.6000    C2         S
152          153         0       3  ...   8.0500   NaN         S
153          154         0       3  ...  14.5000   NaN         S
154          155         0       3  ...   7.3125   NaN         S
155          156         0       1  ...  61.3792   NaN         C

[156 rows x 12 columns]

In [0]:
titanic_train.tail(10)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
146          147         1       3  ...   7.7958   NaN         S
147          148         0       3  ...  34.3750   NaN         S
148          149         0       2  ...  26.0000    F2         S
149          150         0       2  ...  13.0000   NaN         S
150          151         0       2  ...  12.5250   NaN         S
151          152         1       1  ...  66.6000    C2         S
152          153         0       3  ...   8.0500   NaN         S
153          154         0       3  ...  14.5000   NaN         S
154          155         0       3  ...   7.3125   NaN         S
155          156         0       1  ...  61.3792   NaN         C

[10 rows x 12 columns]

##check the data type of the attributes in the DataFrame

In [0]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [0]:
titanic_train.dtypes == "object"
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
print(a)
titanic_train[a].describe()

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

                     Name   Sex        Ticket        Cabin Embarked
count                 156   156           156           31      155
unique                156     2           145           28        3
top     Rugg, Miss. Emily  male  S.O.C. 14879  C23 C25 C27        S
freq                    1   100             2            2      110

## Summary Statistics of Categorical Values

In [0]:
titanic_train.describe(include='O')

                     Name   Sex        Ticket        Cabin Embarked
count                 156   156           156           31      155
unique                156     2           145           28        3
top     Rugg, Miss. Emily  male  S.O.C. 14879  C23 C25 C27        S
freq                    1   100             2            2      110

## Summary Statistics of Numerical Values

In [0]:
titanic_train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   156.000000  156.000000  156.000000  ...  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077  ...    0.615385    0.397436   28.109587
std      45.177428    0.477275    0.795459  ...    1.056235    0.870146   39.401047
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    6.750000
25%      39.750000    0.000000    2.000000  ...    0.000000    0.000000    8.003150
50%      78.500000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     117.250000    1.000000    3.000000  ...    1.000000    0.000000   30.371850
max     156.000000    1.000000    3.000000  ...    5.000000    5.000000  263.000000

[8 rows x 7 columns]

In [0]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [0]:
titanic_train.dtypes[titanic_train.dtypes == "object"]


titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [0]:
titanic_train.dtypes[titanic_train.dtypes == "object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [0]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "object"].index
titanic_train[list_col].describe()

                     Name   Sex        Ticket        Cabin Embarked
count                 156   156           156           31      155
unique                156     2           145           28        3
top     Rugg, Miss. Emily  male  S.O.C. 14879  C23 C25 C27        S
freq                    1   100             2            2      110

In [0]:
titanic_train[['Name','Sex','Age']].head()

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

## Check the first 10 sorted names

In [0]:
sorted(titanic_train["Name"])[:10]

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Allen, Mr. William Henry',
 'Andersson, Miss. Ellis Anna Maria',
 'Andersson, Miss. Erna Alexandra',
 'Andersson, Mr. Anders Johan',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andreasson, Mr. Paul Edvin',
 'Andrew, Mr. Edgardo Samuel',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [0]:
sorted(titanic_train["Name"])[5:10:2]# Check the  sorted names fgrom 5th  item to 10th skipping 2 rows at a time

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andrew, Mr. Edgardo Samuel',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [0]:
titanic_train["Name"].describe()

count                   156
unique                  156
top       Rugg, Miss. Emily
freq                      1
Name: Name, dtype: object

In [0]:
titanic_train[["Ticket"]][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [0]:
print(titanic_train["Ticket"].describe())
print('*'*80)
titanic_train.columns

count              156
unique             145
top       S.O.C. 14879
freq                 2
Name: Ticket, dtype: object
********************************************************************************

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

##Assinging deafult values to a column attribute in a dataframe

In [0]:
titanic_train["sudh"]="sdffs"
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,sdffs

In [0]:
titanic_train["Cabin"][0:15]       # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [30]:
titanic_train.dtypes# Check number of unique cabins

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [31]:
titanic_train["Survived"].value_counts()

0    102
1     54
Name: Survived, dtype: int64

## Retrive the feature names in the dataframe

In [32]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## summary Statistics

In [33]:
titanic_train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   156.000000  156.000000  156.000000  ...  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077  ...    0.615385    0.397436   28.109587
std      45.177428    0.477275    0.795459  ...    1.056235    0.870146   39.401047
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    6.750000
25%      39.750000    0.000000    2.000000  ...    0.000000    0.000000    8.003150
50%      78.500000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     117.250000    1.000000    3.000000  ...    1.000000    0.000000   30.371850
max     156.000000    1.000000    3.000000  ...    5.000000    5.000000  263.000000

[8 rows x 7 columns]

In [34]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])

new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [35]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [36]:
titanic_train["Cabin"].value_counts()

C23 C25 C27    2
D26            2
C123           2
E101           1
F G73          1
B78            1
D56            1
C52            1
E31            1
D47            1
C83            1
B58 B60        1
B30            1
F2             1
A5             1
C85            1
C2             1
B86            1
G6             1
F E69          1
D10 D12        1
C103           1
A6             1
B28            1
C110           1
E46            1
F33            1
D33            1
Name: Cabin, dtype: int64

In [37]:
import numpy as np 
char_cabin = titanic_train["Cabin"].astype(str) # Convert data to str

new_Cabin = [cabin[0] for cabin in char_cabin] # Take first letter

new_Cabin = pd.Categorical(new_Cabin)
#new_Cabin
new_Cabin

[n, C, n, C, n, ..., C, n, n, n, n]
Length: 156
Categories (8, object): [A, B, C, D, E, F, G, n]

In [38]:
titanic_train["Cabin"] = new_Cabin
titanic_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500     n         S
1            2         1       1  ...  71.2833     C         C
2            3         1       3  ...   7.9250     n         S
3            4         1       1  ...  53.1000     C         S
4            5         0       3  ...   8.0500     n         S

[5 rows x 12 columns]

In [39]:
titanic_train["Age"].isnull().sum()

30

## Find the index positions of the column containing NULL values

In [0]:
missing = np.where(titanic_train["Age"].isnull() == True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154]),)

## Retrive index positions of the rows that have the maximum fare

In [40]:
np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

(array([27, 88]),)

In [42]:
titanic_train.loc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

    PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
27           28         0       1  ...  263.0     C         S
88           89         1       1  ...  263.0     C         S

[2 rows x 12 columns]

In [43]:
titanic_train.iloc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

    PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
27           28         0       1  ...  263.0     C         S
88           89         1       1  ...  263.0     C         S

[2 rows x 12 columns]

In [46]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
titanic_train["Family"].head()

0    1
1    1
2    0
3    1
4    0
Name: Family, dtype: int64

In [47]:
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family

(array([59, 71]),)

In [48]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
titanic_train.iloc[most_family]

    PassengerId  Survived  Pclass  ... Cabin Embarked  Family
59           60         0       3  ...     n        S       7
71           72         0       3  ...     n        S       7

[2 rows x 13 columns]

In [49]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)
pd.Series(my_data, index=labels)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [50]:
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [51]:
print ("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr)[1])

Holding numerical data
-------------------------
20

In [52]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [53]:

d = {'a':"kjhk",'b':20,'c':30}
d.items
pd.DataFrame(d,index = ['a','b','c'])

      a   b   c
a  kjhk  20  30
b  kjhk  20  30
c  kjhk  20  30

In [54]:
print ("\nHolding objects from a dictionary\n",'-'*40, sep='')
print(pd.Series([type, sum, max]))

Holding objects from a dictionary
----------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [55]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [56]:
ser2

CA    1
OR    2
NV    5
AZ    4
dtype: int64

In [57]:
ser1[0:3:2]

2    1
6    3
dtype: int64

In [60]:
ser1[0:]

2    1
4    2
6    3
8    4
dtype: int64

In [58]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser1[0])
print("Value for AZ in ser1:", ser1[3])
print("Value for NV in ser2:", ser2[2])
ser1

Indexing by number (positional value in the series)
----------------------------------------------------

KeyError: ignored

In [61]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser1:\n", ser1[0:3:2], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser1:
2    1
6    3
dtype: int64

In [62]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
print(ser1)
print('*'*80)
print(ser2)
ser3

CA    1
OR    2
CO    3
CA    4
dtype: int64
********************************************************************************
CA    1
NV    2
AZ    5
OR    4
dtype: int64

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [64]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [65]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [66]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings)
#print("\nThe data frame looks like\n",'-'*45, sep='')
df

          W         X         Y         Z
A -0.322589 -0.540147 -0.430644  0.210900
B  0.412268  0.331110  0.649227 -0.305412
C -1.202466 -1.194462 -1.476798  0.247416
D -0.577361 -0.304563 -1.274992 -0.047975
E -0.544548 -0.812271  0.316422 -1.056691

In [67]:
df.iloc[2]

W   -1.202466
X   -1.194462
Y   -1.476798
Z    0.247416
Name: C, dtype: float64

In [68]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [69]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df["X"])

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
A   -0.540147
B    0.331110
C   -1.194462
D   -0.304563
E   -0.812271
Name: X, dtype: float64

In [70]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A -0.322589 -0.540147 -0.430644  0.210900 -0.329247             -0.329247
B  0.412268  0.331110  0.649227 -0.305412  0.025698              0.025698
C -1.202466 -1.194462 -1.476798  0.247416 -0.947046             -0.947046
D -0.577361 -0.304563 -1.274992 -0.047975 -0.352539             -0.352539
E -0.544548 -0.812271  0.316422 -1.056691 -1.868962             -1.868962

In [71]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A -0.322589 -0.540147 -0.430644  0.210900 -0.329247             -0.329247
B  0.412268  0.331110  0.649227 -0.305412  0.025698              0.025698
C -1.202466 -1.194462 -1.476798  0.247416 -0.947046             -0.947046
D -0.577361 -0.304563 -1.274992 -0.047975 -0.352539             -0.352539
E -0.544548 -0.812271  0.316422 -1.056691 -1.868962             -1.868962

In [72]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep=' ')
df.drop("C",inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

A column is dropped by using df.drop() method
 -------------------------------------------------------

In [73]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A -0.322589 -0.540147 -0.430644  0.210900 -0.329247             -0.329247
B  0.412268  0.331110  0.649227 -0.305412  0.025698              0.025698
D -0.577361 -0.304563 -1.274992 -0.047975 -0.352539             -0.352539
E -0.544548 -0.812271  0.316422 -1.056691 -1.868962             -1.868962

In [74]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
B  0.412268  0.331110  0.649227 -0.305412  0.025698              0.025698
D -0.577361 -0.304563 -1.274992 -0.047975 -0.352539             -0.352539
E -0.544548 -0.812271  0.316422 -1.056691 -1.868962             -1.868962

In [75]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z       New
A -0.322589 -0.540147 -0.430644  0.210900 -0.329247
B  0.412268  0.331110  0.649227 -0.305412  0.025698
D -0.577361 -0.304563 -1.274992 -0.047975 -0.352539
E -0.544548 -0.812271  0.316422 -1.056691 -1.868962

In [76]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method
df

          W         X         Y         Z       New
A -0.322589 -0.540147 -0.430644  0.210900 -0.329247
B  0.412268  0.331110  0.649227 -0.305412  0.025698
D -0.577361 -0.304563 -1.274992 -0.047975 -0.352539
E -0.544548 -0.812271  0.316422 -1.056691 -1.868962

In [77]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[3])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W     -0.544548
X     -0.812271
Y      0.316422
Z     -1.056691
New   -1.868962
Name: E, dtype: float64

In [78]:
print("\nMultiple rows\n")
print(df.loc[['B','C']])

Multiple rows

          W        X         Y         Z       New
B  0.412268  0.33111  0.649227 -0.305412  0.025698
C       NaN      NaN       NaN       NaN       NaN

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike

In [79]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
----------------------------------------------------------------------

Single row

W     -0.577361
X     -0.304563
Y     -1.274992
Z     -0.047975
New   -0.352539
Name: D, dtype: float64

In [80]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

Multiple rows

          W         X         Y         Z       New
B  0.412268  0.331110  0.649227 -0.305412  0.025698
D -0.577361 -0.304563 -1.274992 -0.047975 -0.352539

In [0]:
#### Subsetting DataFrame

In [0]:

matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [82]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z
A -0.708766 -0.019945  0.101644 -0.144065
B -0.940332  0.023386 -2.193244  0.155620
C  1.447655  1.151449  1.659261 -1.007764
D -0.294131  0.055260 -0.172092 -1.057376
E -1.326751 -0.544216  0.671805 -0.138219

In [83]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc[['B','C'],['Y','W']])

Element at row 'B' and column 'Y' is

          Y         W
B -2.193244 -0.940332
C  1.659261  1.447655

In [84]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows B and D, and columns W and Y, is

          W         X
B -0.940332  0.023386
C  1.447655  1.151449
D -0.294131  0.055260

In [85]:
print(df.loc[['B','C'],])

          W         X         Y         Z
B -0.940332  0.023386 -2.193244  0.155620
C  1.447655  1.151449  1.659261 -1.007764

In [86]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z
A -0.708766 -0.019945  0.101644 -0.144065
B -0.940332  0.023386 -2.193244  0.155620
C  1.447655  1.151449  1.659261 -1.007764
D -0.294131  0.055260 -0.172092 -1.057376
E -1.326751 -0.544216  0.671805 -0.138219

In [87]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A  False  False   True  False
B  False   True  False   True
C   True   True   True  False
D  False   True  False  False
E  False  False   True  False

In [88]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A  False  False   True  False
B  False   True  False   True
C   True   True   True  False

In [89]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
          W         X         Y        Z
A       NaN       NaN  0.101644      NaN
B       NaN  0.023386       NaN  0.15562
C  1.447655  1.151449  1.659261      NaN
D       NaN  0.055260       NaN      NaN
E       NaN       NaN  0.671805      NaN

In [90]:

import pandas as pd 
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [91]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [92]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [93]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [94]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [0]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [96]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [97]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160

In [0]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [100]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [101]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [0]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

After resetting index with 'drop' option TRUE
---------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [102]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

Adding a new column 'Profession'
---------------------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [103]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

In [0]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [105]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [106]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [107]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [108]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
-------------------------------------
        A    B    C
G1 1 -0.0  0.0  1.0
   2 -0.0 -1.0 -2.0
   3 -0.0  0.0  1.0
G2 1 -1.0 -0.0 -1.0
   2  0.0  0.0  1.0
   3 -1.0 -1.0  0.0

In [0]:
#cross tabulation like pivot table

In [109]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
     A    B    C
1 -0.0  0.0  1.0
2 -0.0 -1.0 -2.0
3 -0.0  0.0  1.0